const nameRegex   = /^[a-zA-Z\u0621-\u064A\s]{2,12}$/;
const maleJobs    = ['مسعف', 'شرطي', 'مجرم', 'مصلح'];
const femaleJobs  = ['مسعفة', 'شرطية', 'مجرمة', 'مصلحة'];

const jobToRoleMap = {
    'مسعف':   '1380650660336369705',
    'مسعفة':  '1380650660336369705',
    'شرطي':   '1380650132823081000',
    'شرطية':  '1380650132823081000',
    'مجرم':   '1380650589800628264',
    'مجرمة':  '1380650589800628264',
    'مصلح':   '1380650805027278999',
    'مصلحة':  '1380650805027278999'
};

const roleToJobsMap = {
    '1380650660336369705': ['مسعف',  'مسعفة'],
    '1380650132823081000': ['شرطي',  'شرطية'],
    '1380650589800628264': ['مجرم',  'مجرمة'],
    '1380650805027278999': ['مصلح',  'مصلحة']
};

module.exports = { nameRegex, maleJobs, femaleJobs, jobToRoleMap, roleToJobsMap };
